app/controllers/users_controller.rb

  def index
    @users = []
    @users = User.all
---
SELECT "users".* FROM "users"

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("username", "email", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?)

  def update
    @user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "username" = ?, "email" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "Moimoi"], ["email", "yoyo@lala.nette"], ["password_digest", "$2a$10$BtSts9ybBE4BJT/6fyZtiOa.qd4ZQBNY8LJ4neh5aKSRdf35wFcK6"], ["updated_at", "2018-02-06 03:18:29.006754"], ["id", 1]]